#ifndef __CIFPACK_H__
#define __CIFPACK_H__
/****CIF报文结构定义****/
typedef struct{
	char blockhead[3];	/**{1:**/
	char length[6];		/**报文长度**/
	char use;			/**0**/
	char inout;			/**0-提出,1-提入**/
	char ywtype;		/**2-CIF**/
	char status[3];		/**000-成功,001-报文结构错误,其他失败****/
	char flgno[8];		/**报文标识号**/
	char refno[20];		/**报文参考号**/
	char sendtm[14];	/**发送时间**/
	char cifno[3];		/**报文类型,100-支票截留,101-通用截留***/
	char workdate[8];	/**工作日期**/
	char blocktail;		/**	}**/
}TCIFHEAD;
typedef struct{
	char blockhead[3];	/**{3:**/
	char buffer[1024*20];
}TCIFBODY;
typedef struct{
	TCIFHEAD head;
	TCIFBODY body;
}TCIFPACK;
void vInitCifPack(TCIFPACK *);
void vAddCifTag(TCIFPACK *pack,char *tagname,char *tagdata);
void vGetCifTag(TCIFPACK *pack,char *tagname,char *tagdata);
int nDealCifPack(TCIFPACK *pack);
/* begin add by LiuHuafeng 2007-5-16 7:07 */
/* 存放银之杰报文体结构 */
#define YZJ_100_LEN 28
#define YZJ_101_LEN 36
struct STR_YZJ {
	char name[81];  /* 中文名字 */
	char len[4];    /* 长度 */
	char type[3];   /* 数据类型 */
	char tagname[4];/* 对应燕联tag名字 */
};
struct STR_YZJ str_yzj_100[YZJ_100_LEN]={
	"委托日期\0","8\0","A\0","30A\0",
	"交易序号\0","8\0","N\0","0BC\0",
	"收款人(开户行)行号\0","12\0","N\0","CC5\0",
	"收款人账号\0","32\0","A\0","59C\0",
	"收款人名称\0","60\0","A\0","59A\0",
	"出票人(开户行)行号\0","12\0","N\0","D21\0",
	"出票人账号\0","32\0","A\0","D23\0",
	"出票人名称\0","60\0","A\0","D22\0",
	"货币符号\0","18\0","A\0","32A\0",
	"票据号码\0","12\0","N\0","D01\0",
	"出票日期\0","8\0","N\0","D35\0",
	"提示付款日期\0","8\0","N\0","D36\0",
	"支付密码\0","20\0","A\0","D30\0",
	"用途\0","60\0","A\0","D37\0",
	"备注\0","120\0","A\0","D38\0",
	"系统受理日期\0","8\0","N\0","D34\0",
	"回执期限\0","8\0","N\0","BS6\0",
	"补发标志\0","1\0","N\0","BS4\0",
	"背书次数\0","2\0","N\0","D41\0",
	"背书人清单\0","100\0","A\0","D42\0",
	"业务状态\0","2\0","N\0","YWZ\0",
	"退票代码\0","16\0","A\0","TPD\0",
	"自输退票理由\0","60\0","A\0","TPN\0",
	"图像传输格式\0","1\0","\0","CSG\0",
	"正面图像长度\0","8\0","N\0","ZMC\0",
	"反面图像长度\0","8\0","N\0","FMC\0",
	"正面图像数据\0","Nx\0","A\0","72E\0",
	"反面图像数据\0","Nx\0","A\0","72F\0"
};
struct STR_YZJ str_yzj_101[YZJ_101_LEN]={
"委托日期\0","8\0","A\0","30A\0",
"交易序号\0","8\0","N\0","0BC\0",
"收款人(开户行)行号\0","12\0","N\0","CC5\0",
"收款人账号\0","32\0","A\0","59C\0",
"收款人名称\0","60\0","A\0","59A\0",
"出票人(开户行)行号\0","12\0","N\0","D21\0",
"出票人账号\0","32\0","A\0","D23\0",
"出票人名称\0","60\0","A\0","D22\0",
"货币符号\0","3\0","A\0","32A\0",
"票据号码\0","12\0","N\0","D01\0",
"出票日期\0","8\0","N\0","D35\0",
"提示付款日期\0","8\0","N\0","D36\0",
"银行汇票密押\0","20\0","A\0","D51\0",
"出票金额\0","15\0","N\0","33H\0",
"汇票到期日\0","8\0","N\0","D61\0",
"承兑协议编号\0","20\0","A\0","D62\0",
"交易合同号码\0","20\0","A\0","D63\0",
"承兑日期\0","8\0","N\0","D64\0",
"承兑行\0","12\0","N\0","D65\0",
"承兑人\0","60\0","A\0","D66\0",
"用途\0","60\0","A\0","D37\0",
"附言\0","120\0","A\0","D38\0",
"系统受理日期\0","8\0","N\0","D34\0",
"回执期限\0","8\0","N\0","BS6\0",
"补发标志\0","1\0","N\0","BS4\0",
"背书次数\0","2\0","N\0","D41\0",
"背书人清单\0","100\0","A\0","D42\0",
"业务状态\0","2\0","N\0","YWZ\0",
"退票代码\0","16\0","A\0","TPD\0",
"自输退票理由\0","60\0","A\0","TPL\0",
"通用票据种类\0","4\0","A\0","D32\0",
"图像传输格式\0","1\0","\0","CSG\0",
"正面图像长度\0","8\0","N\0","ZMC\0",
"反面图像长度\0","8\0","N\0","FMC\0",
"正面图像数据\0","nX\0","A\0","72E\0",
"反面图像数据\0","nX\0","A\0","72F\0",
};
/* end by LiuHuafeng 2007-5-16 7:07 */
#endif
